src/test/resources/mocks/payments/response/contexts/payment_context_paypal_details_response.json

{
  "partner_metadata": {
    "customer_id": "WXZ3YUKYW27V4",
    "order_id": "0UX64350RX431305J"
  },
  "payment_request": {
    "amount": 2500,
    "authorization_type": "Final",
    "capture": true,
    "currency": "GBP",
    "failure_url": "https://www.spaseekers.com/checkout/checkoutdotcom3/payment-failed",
    "items": [
      {
        "discount_amount": 0,
        "name": "£25.00 Voucher",
        "quantity": 1,
        "tax_amount": 0,
        "total_amount": 2500,
        "unit_price": 2500
      }
    ],
    "payment_type": "Regular",
    "processing": {
      "shipping_amount": 0,
      "user_action": "PAY_NOW"
    },
    "processing_channel_id": "pc_strugfrty47ellyymdfg6fzhc4i",
    "reference": "770859",
    "shipping": {
      "address": {
        "address_line1": "6 May Close",
        "address_line2": "Goring-by-Sea",
        "city": "Worthing",
        "country": "GB",
        "state": "WEST SUSSEX",
        "zip": "BN12 6HW"
      },
      "first_name": "Matthew Abbott"
    },
    "source": {
      "account_holder": {
        "email": "me+paypal@matthewabbott.dev",
        "full_name": "Matthew Abbott"
      },
      "type": "paypal"
    },
    "success_url": "https://www.spaseekers.com/checkout/checkoutdotcom3/payment-successful"
  },
  "status": "Created"
}